service-chain-editor/example2.wsdl

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ows="http://www.opengis.net/ows/1.1" xmlns:wps="http://www.opengis.net/wps/1.0.0" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://localhost/wps.cgi_wsdl" targetNamespace="http://localhost/wps.cgi_wsdl"><types><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/ows/1.1"><include schemaLocation="http://schemas.opengis.net/ows/1.1.0/owsExceptionReport.xsd"/></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><include schemaLocation="http://schemas.opengis.net/wps/1.0.0/wpsGetCapabilities_request.xsd"/></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><include schemaLocation="http://schemas.opengis.net/wps/1.0.0/wpsGetCapabilities_response.xsd"/></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><include schemaLocation="http://schemas.opengis.net/wps/1.0.0/wpsDescribeProcess_request.xsd"/></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><include schemaLocation="http://schemas.opengis.net/wps/1.0.0/wpsDescribeProcess_response.xsd"/></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><include schemaLocation="http://schemas.opengis.net/wps/1.0.0/wpsExecute_request.xsd"/></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><include schemaLocation="http://schemas.opengis.net/wps/1.0.0/wpsExecute_response.xsd"/></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/ows/1.1"><include schemaLocation="http://schemas.opengis.net/ows/1.1.0/owsExceptionReport.xsd"/></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><element name="ExecuteProcess_v.net.path"><complexType><sequence><element minOccurs="0" maxOccurs="1" name="alayer" type="xsd:string"/><element minOccurs="0" maxOccurs="1" name="s" type="xsd:boolean"/><element minOccurs="0" maxOccurs="1" name="abcolumn" type="xsd:string"/><element minOccurs="0" maxOccurs="1" name="g" type="xsd:boolean"/><element minOccurs="0" maxOccurs="1" name="ncolumn" type="xsd:string"/><element minOccurs="0" maxOccurs="1" name="file"/><element minOccurs="0" maxOccurs="1" name="afcolumn" type="xsd:string"/><element minOccurs="1" maxOccurs="1" name="input"/><element minOccurs="0" maxOccurs="1" name="dmax" type="xsd:float"/><element minOccurs="0" maxOccurs="1" name="nlayer" type="xsd:string"/><element minOccurs="0" maxOccurs="1024" name="type" type="xsd:string"/></sequence></complexType></element></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><element name="ExecuteProcess_v.net.pathResponse"><complexType><sequence><element name="outputResult" minOccurs="1" maxOccurs="1"/></sequence></complexType></element></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><element name="ExecuteProcessAsync_v.net.path"><complexType><sequence><element minOccurs="0" maxOccurs="1" name="alayer" type="xsd:string"/><element minOccurs="0" maxOccurs="1" name="s" type="xsd:boolean"/><element minOccurs="0" maxOccurs="1" name="abcolumn" type="xsd:string"/><element minOccurs="0" maxOccurs="1" name="g" type="xsd:boolean"/><element minOccurs="0" maxOccurs="1" name="ncolumn" type="xsd:string"/><element minOccurs="0" maxOccurs="1" name="file"/><element minOccurs="0" maxOccurs="1" name="afcolumn" type="xsd:string"/><element minOccurs="1" maxOccurs="1" name="input"/><element minOccurs="0" maxOccurs="1" name="dmax" type="xsd:float"/><element minOccurs="0" maxOccurs="1" name="nlayer" type="xsd:string"/><element minOccurs="0" maxOccurs="1024" name="type" type="xsd:string"/></sequence></complexType></element></schema><schema xmlns="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.opengis.net/wps/1.0.0"><element name="ExecuteProcessAsync_v.net.pathResponse"><complexType><sequence><element name="statusURLResult" minOccurs="1" maxOccurs="1"/></sequence></complexType></element></schema></types><message name="GetCapabilitiesRequest"><part name="msg" element="wps:GetCapabilities"/></message><message name="GetCapabilitiesResponse"><part name="msg" element="wps:Capabilities"/></message><message name="DescribeProcessRequest"><part name="msg" element="wps:DescribeProcess"/></message><message name="DescribeProcessResponse"><part name="msg" element="wps:ProcessDescriptions"/></message><message name="ExecuteRequest"><part name="msg" element="wps:Execute"/></message><message name="ExecuteResponse"><part name="msg" element="wps:ExecuteResponse"/></message><message name="ExceptionResponse"><part name="msg" element="ows:Exception"/></message><message name="ExecuteProcess_v.net.pathRequest"><part name="DataInputs" element="wps:ExecuteProcess_v.net.path"/></message><message name="ExecuteProcess_v.net.pathResponse"><part name="ProcessOutputs" element="wps:ExecuteProcess_v.net.pathResponse"/></message><message name="ExecuteProcessAsync_v.net.pathRequest"><part name="DataInputs" element="wps:ExecuteProcessAsync_v.net.path"/></message><message name="ExecuteProcessAsync_v.net.pathResponse"><part name="ProcessOutputs" element="wps:ExecuteProcessAsync_v.net.pathResponse"/></message><portType name="PywpsServer_PortType"><operation name="GetCapabilities"><input message="tns:GetCapabilitiesRequest"/><output message="tns:GetCapabilitiesResponse"/><fault name="ExceptionResponse" message="tns:ExceptionResponse"/></operation><operation name="DescribeProcess"><input message="tns:DescribeProcessRequest"/><output message="tns:DescribeProcessResponse"/><fault name="ExceptionResponse" message="tns:ExceptionResponse"/></operation><operation name="Execute"><input message="tns:ExecuteRequest"/><output message="tns:ExceptionResponse"/><fault name="ExceptionResponse" message="tns:ExceptionResponse"/></operation><operation name="ExecuteProcess_v.net.path"><input message="tns:ExecuteProcess_v.net.pathRequest"/><output message="tns:ExecuteProcess_v.net.pathResponse"/><fault name="ExceptionResponse" message="tns:ExceptionResponse"/></operation><operation name="ExecuteProcessAsync_v.net.path"><input message="tns:ExecuteProcessAsync_v.net.pathRequest"/><output message="tns:ExecuteProcessAsync_v.net.pathResponse"/><fault name="ExceptionResponse" message="tns:ExceptionResponse"/></operation></portType><binding name="PywpsServer_Binding" type="tns:PywpsServer_PortType"><binding xmlns="http://schemas.xmlsoap.org/wsdl/soap/" style="document" transport="http://schemas.xmlsoap.org/soap/http"/><operation name="GetCapabilities"><operation xmlns="http://schemas.xmlsoap.org/wsdl/soap/" soapAction="http://localhost/wps.cgi/GetCapabilities" style="document"/><input name="GetCapabilitiesRequest"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></input><output name="GetCapabilitiesResponse"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></output><fault name="ExceptionResponse"><fault xmlns="http://schemas.xmlsoap.org/wsdl/soap/" name="ExceptionResponse" use="literal"/></fault></operation><operation name="DescribeProcess"><operation xmlns="http://schemas.xmlsoap.org/wsdl/soap/" soapAction="http://localhost/wps.cgi/DescribeProcess" style="document"/><input name="DescribeProcessRequest"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></input><output name="DescribeProcessResponse"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></output><fault name="ExceptionResponse"><fault xmlns="http://schemas.xmlsoap.org/wsdl/soap/" name="ExceptionResponse" use="literal"/></fault></operation><operation name="Execute"><operation xmlns="http://schemas.xmlsoap.org/wsdl/soap/" soapAction="http://localhost/wps.cgi/Execute" style="document"/><input name="ExecuteRequest"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></input><output name="ExecuteResponse"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></output><fault name="ExceptionResponse"><fault xmlns="http://schemas.xmlsoap.org/wsdl/soap/" name="ExceptionResponse" use="literal"/></fault></operation><operation name="ExecuteProcess_v.net.path"><operation xmlns="http://schemas.xmlsoap.org/wsdl/soap/" soapAction="http://localhost/wps.cgi/ExecuteProcess_v.net.path" style="document"/><input name="ExecuteProcess_v.net.pathRequest"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></input><output name="ExecuteProcess_v.net.pathResponse"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></output><fault name="ExceptionResponse"><fault xmlns="http://schemas.xmlsoap.org/wsdl/soap/" name="ExceptionResponse" use="literal"/></fault></operation><operation name="ExecuteProcessAsync_v.net.path"><operation xmlns="http://schemas.xmlsoap.org/wsdl/soap/" soapAction="http://localhost/wps.cgi/ExecuteProcessAsync_v.net.path" style="document"/><input name="ExecuteProcessAsync_v.net.pathRequest"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></input><output name="ExecuteProcessAsync_v.net.pathResponse"><body xmlns="http://schemas.xmlsoap.org/wsdl/soap/" use="literal"/></output><fault name="ExceptionResponse"><fault xmlns="http://schemas.xmlsoap.org/wsdl/soap/" name="ExceptionResponse" use="literal"/></fault></operation></binding><service name="PywpsServer"><documentation/><port name="PywpsServer_Port" binding="tns:PywpsServer_Binding"><address xmlns="http://schemas.xmlsoap.org/wsdl/soap/" location="http://localhost/wps.cgi"/></port></service></definitions>